Revit 2027 API
PipeFittingAndAccessoryData.BehaviorType Property
 The behavior type of the pipe fitting or pipe accessory.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int BehaviorType { get; }
Public ReadOnly Property BehaviorType As Integer
	Get
public:
property int BehaviorType {
	int get ();
}
member BehaviorType : int with get
Property Value
Int32
See Also
Reference
PipeFittingAndAccessoryData Class
Autodesk.Revit.DB.Plumbing Namespace